MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F04KA201/mcu.h
/* Register FOSC (0xf80008)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0xf80008),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

/*
** Only one invocation of FOSC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSC.
** Multiple options may be combined, as shown:
**
** _FOSC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Configuration bits:
**     POSCMOD_EC           External Clock mode selected
**     POSCMOD_XT           XT Oscillator mode selected
**     POSCMOD_HS           HS Oscillator mode selected
**     POSCMOD_NONE         Primary oscillator disabled
**
**   CLKO Enable Configuration bit:
**     OSCIOFNC_ON          CLKO output disabled
**     OSCIOFNC_OFF         CLKO output signal active on the OSCO pin; primary oscillator must be disabled or configured for the External Clock mode (EC) for the CLKO to be active (POSCMD<1:0>)
**
**   Primary Oscillator Frequency Range Configuration bits:
**     POSCFREQ_LS          Primary oscillator/external clock input frequency less than 100 kHz
**     POSCFREQ_MS          Primary oscillator/external clock input frequency between 100 kHz and 8 MHz
**     POSCFREQ_HS          Primary oscillator/external clock input frequency greater than 8 MHz
**
**   SOSC Power Selection Configuration bits:
**     SOSCSEL_SOSCLP       Secondary oscillator configured for low-power operation
**     SOSCSEL_SOSCHP       Secondary oscillator configured for high-power operation
**
**   Clock Switching and Monitor Selection:
**     FCKSM_CSECME         Clock switching is enabled, Fail-Safe Clock Monitor is enabled
**     FCKSM_CSECMD         Clock switching is enabled, Fail-Safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Clock switching is disabled, Fail-Safe Clock Monitor is disabled
**
*/

#define POSCMOD_EC           0x00FC
#define POSCMOD_XT           0x00FD
#define POSCMOD_HS           0x00FE
#define POSCMOD_NONE         0x00FF

#define OSCIOFNC_ON          0x00FB
#define OSCIOFNC_OFF         0x00FF

#define POSCFREQ_LS          0x00EF
#define POSCFREQ_MS          0x00F7
#define POSCFREQ_HS          0x00FF

#define SOSCSEL_SOSCLP       0x00DF
#define SOSCSEL_SOSCHP       0x00FF

#define FCKSM_CSECME         0x003F
#define FCKSM_CSECMD         0x007F
#define FCKSM_CSDCMD         0x00BF

/* Register FWDT (0xf8000a)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0xf8000a),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Watchdog Timer Postscale Select bits:
**     WDTPS_PS1            1:1
**     WDTPS_PS2            1:2
**     WDTPS_PS4            1:4
**     WDTPS_PS8            1:8
**     WDTPS_PS16           1:16
**     WDTPS_PS32           1:32
**     WDTPS_PS64           1:64
**     WDTPS_PS128          1:128
**     WDTPS_PS256          1:256
**     WDTPS_PS512          1:512
**     WDTPS_PS1024         1:1,024
**     WDTPS_PS2048         1:2,048
**     WDTPS_PS4096         1:4,096
**     WDTPS_PS8192         1:8,192
**     WDTPS_PS16384        1:16,384
**     WDTPS_PS32768        1:32,768
**
**   WDT Prescaler:
**     FWPSA_PR32           WDT prescaler ratio of 1:32
**     FWPSA_PR128          WDT prescaler ratio of 1:128
**
**   Windowed Watchdog Timer Disable bit:
**     WINDIS_ON            Windowed WDT enabled
**     WINDIS_OFF           Standard WDT selected; windowed WDT disabled
**
**   Watchdog Timer Enable bit:
**     FWDTEN_OFF           WDT disabled (control is placed on the SWDTEN bit)
**     FWDTEN_ON            WDT enabled
**
*/

#define WDTPS_PS1            0x00D0
#define WDTPS_PS2            0x00D1
#define WDTPS_PS4            0x00D2
#define WDTPS_PS8            0x00D3
#define WDTPS_PS16           0x00D4
#define WDTPS_PS32           0x00D5
#define WDTPS_PS64           0x00D6
#define WDTPS_PS128          0x00D7
#define WDTPS_PS256          0x00D8
#define WDTPS_PS512          0x00D9
#define WDTPS_PS1024         0x00DA
#define WDTPS_PS2048         0x00DB
#define WDTPS_PS4096         0x00DC
#define WDTPS_PS8192         0x00DD
#define WDTPS_PS16384        0x00DE
#define WDTPS_PS32768        0x00DF

#define FWPSA_PR32           0x00CF
#define FWPSA_PR128          0x00DF

#define WINDIS_ON            0x009F
#define WINDIS_OFF           0x00DF

#define FWDTEN_OFF           0x005F
#define FWDTEN_ON            0x00DF

/* Register FPOR (0xf8000c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0xf8000c),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Brown-out Reset Enable bits:
**     BOREN_BOR0           Brown-out Reset disabled in hardware; SBOREN bit disabled
**     BOREN_BOR1           Brown-out Reset controlled with the SBOREN bit setting
**     BOREN_BOR2           Brown-out Reset enabled only while device is active and disabled in Sleep; SBOREN bit disabled
**     BOREN_BOR3           Brown-out Reset enabled in hardware; SBOREN bit disabled
**
**   Power-up Timer Enable bit:
**     PWRTEN_OFF           PWRT disabled
**     PWRTEN_ON            PWRT enabled
**
**   Brown-out Reset Voltage bits:
**     BORV_LPBOR           Low-Power Brown-out reset occurs around 2.0V
**     BORV_27V             Brown-out Reset set to highest voltage (2.7V)
**     BORV_V27             Brown-out Reset set to highest voltage (2.7V)
**     BORV_20V             Brown-out Reset set to 2.0V
**     BORV_V20             Brown-out Reset set to 2.0V
**     BORV_18V             Brown-out Reset set to lowest voltage (1.8V)
**     BORV_V18             Brown-out Reset set to lowest voltage (1.8V)
**
**   MCLR Pin Enable bit:
**     MCLRE_OFF            RA5 input pin enabled; MCLR disabled
**     MCLRE_ON             MCLR pin enabled; RA5 input pin disabled
**
*/

#define BOREN_BOR0           0x00F8
#define BOREN_BOR1           0x00F9
#define BOREN_BOR2           0x00FA
#define BOREN_BOR3           0x00FB

#define PWRTEN_OFF           0x00F3
#define PWRTEN_ON            0x00FB

#define BORV_LPBOR           0x009B
#define BORV_27V             0x00BB
#define BORV_V27             0x00BB
#define BORV_20V             0x00DB
#define BORV_V20             0x00DB
#define BORV_18V             0x00FB
#define BORV_V18             0x00FB

